### Pandas
- Great module to manipulate data.
- Similar to a excel file.

In [1]:
#Pandas
import pandas as pd
import numpy as np

In [3]:
# Pandas give lots of functions to load data
# pd.read_csv(), pd.read_json(), pd.read_html()... are available
iris = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data")
print ( iris )
print(type(iris)) # Dataframe #First line is considered as column header
# Dataframe is 2D table: rowxcolumn

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]
<class 'pandas.core.frame.DataFrame'>

### Accessing Data in Pandas

In [4]:
# df = iris in this case any changes in df will make the same changes in iris as well
df = iris.copy()

In [22]:
df.head()

    s1   sw   p1   pw  flower_type
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [20]:
df.columns = ['s1', 'sw', 'p1', 'pw', 'flower_type']

In [21]:
print(df.shape) # Tells the shape of the df
print(df.dtypes) # Shows dtypes of each column

(149, 5)
s1             float64
sw             float64
p1             float64
pw             float64
flower_type     object
dtype: object

In [23]:
df.describe() # Int columns will be 'described'

               s1          sw          p1          pw
count  149.000000  149.000000  149.000000  149.000000
mean     5.848322    3.051007    3.774497    1.205369
std      0.828594    0.433499    1.759651    0.761292
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.400000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [26]:
# To access particular column use df["sl"] or df.sl
df.s1

0      4.9
1      4.7
2      4.6
3      5.0
4      5.4
      ...
144    6.7
145    6.3
146    6.5
147    6.2
148    5.9
Name: s1, Length: 149, dtype: float64

In [27]:
df.isnull()

        s1     sw     p1     pw  flower_type
0    False  False  False  False        False
1    False  False  False  False        False
2    False  False  False  False        False
3    False  False  False  False        False
4    False  False  False  False        False
..     ...    ...    ...    ...          ...
144  False  False  False  False        False
145  False  False  False  False        False
146  False  False  False  False        False
147  False  False  False  False        False
148  False  False  False  False        False

[149 rows x 5 columns]

In [28]:
df.isnull().sum()

s1             0
sw             0
p1             0
pw             0
flower_type    0
dtype: int64

In [29]:
df.iloc[1:4, 2:4] #Access a slice of data df[1:4, 2:3] will give error.

    p1   pw
1  1.3  0.2
2  1.5  0.2
3  1.4  0.2

In [30]:
df["flower_type"].str.count("Iris-versicolor").sum()

50